[
    {
        "title": "Share Your UT Libraries Love Story!",
        "link": "https://volumes.lib.utk.edu/news/share-your-ut-libraries-love-story/",
        "date": "Fri, 10 Feb 2023 17:57:36 +0000",
        "contentSnippet": "By Stacy Palado Did you meet your Valentine at UT Libraries or have another library love story to share? We want to know. Send your UT Libraries love story to spalado@utk.edu.\nThe post Share Your UT Libraries Love Story! appeared first on Speaking Volumes."
    },
    {
        "title": "Maggie Longmire to Perform at Boundless: Artists in the Archives",
        "link": "https://volumes.lib.utk.edu/news/maggie-longmire-to-perform-at-boundless-artists-in-the-archives/",
        "date": "Tue, 07 Feb 2023 20:52:33 +0000",
        "contentSnippet": "Americana singer/songwriter Maggie Longmire will perform at the John C. Hodges Library on Thursday, March 23, 2023. Her appearance — part of the UT Libraries’ program Boundless: Artists in the Archives — will feature the first public performance of original songs inspired by materials held in UT Libraries’ Betsey B. Creekmore Special Collections and University … Continued\nThe post Maggie Longmire to Perform at Boundless: Artists in the Archives appeared first on Speaking Volumes."
    },
    {
        "title": "Douglass Day — Join us for a Lecture and Transcribe-a-thon",
        "link": "https://volumes.lib.utk.edu/news/douglass-day-join-us-for-a-lecture-and-transcribe-a-thon/",
        "date": "Thu, 02 Feb 2023 01:57:45 +0000",
        "contentSnippet": "Douglass Day, celebrated on February 14th, honors America’s great abolitionist, educator, and statesman Frederick Douglass (c. 1817–1895) and encourages us to delve deeper into our country’s complex history of slavery and racism. The University of Tennessee participates in a nationwide Douglass Day initiative that each year focuses on an important figure in Black history. This … Continued\nThe post Douglass Day — Join us for a Lecture and Transcribe-a-thon appeared first on Speaking Volumes."
    },
    {
        "title": "Add Mystery to Your Life with Blind Date with a Book",
        "link": "https://volumes.lib.utk.edu/news/add-mystery-to-your-life-with-blind-date-with-a-book/",
        "date": "Wed, 01 Feb 2023 13:50:17 +0000",
        "contentSnippet": "Add a little mystery to your life throughout the month of February with your next blind date…with a book. Visit the book display on the second floor of Hodges Library across from Starbucks. The books are wrapped in brown paper with hints of the story’s plot. Books celebrating Black creators are festooned with ribbons in … Continued\nThe post Add Mystery to Your Life with Blind Date with a Book appeared first on Speaking Volumes."
    },
    {
        "title": "UT Libraries Partners with GPO to Preserve Government Information",
        "link": "https://volumes.lib.utk.edu/news/ut-libraries-partners-with-gpo-to-preserve-government-information/",
        "date": "Tue, 31 Jan 2023 20:11:27 +0000",
        "contentSnippet": "UT Libraries is partnering with the US Government Publishing Office to preserve government information in an effort to make it more accessible to the public. UT Libraries is one of three university libraries that have signed memorandum of agreements with the US Government Publishing Office (GPO) to become Preservation Stewards. The other two are the … Continued\nThe post UT Libraries Partners with GPO to Preserve Government Information appeared first on Speaking Volumes."
    },
    {
        "title": "UT Libraries Hosts High School Students for BOSS Hands-On STEM Conference",
        "link": "https://volumes.lib.utk.edu/news/ut-libraries-hosts-high-school-students-for-boss-hands-on-stem-conference/",
        "date": "Mon, 30 Jan 2023 17:52:23 +0000",
        "contentSnippet": "By Megan Venable About 140 high school students showed up early one recent morning to experience Big Orange STEM Saturday (BOSS) at the John C. Hodges Library. BOSS is a day-long professional conference that gives students the exclusive opportunity to meet with STEM professors and local collaborators and interact with them to learn more about … Continued\nThe post UT Libraries Hosts High School Students for BOSS Hands-On STEM Conference appeared first on Speaking Volumes."
    },
    {
        "title": "A Lens into Appalachia: A Conversation with Documentary Filmmakers",
        "link": "https://volumes.lib.utk.edu/news/appalachia-documentary-filmmakers/",
        "date": "Tue, 13 Dec 2022 16:12:22 +0000",
        "contentSnippet": "Save the date for the 2023 Wilma Dykeman Stokely Memorial Lecture on Tuesday, February 28, at 7 p.m. (EST), at the Bijou Theater. Join us for a conversation with director and producer Ashley York and documentary filmmaker Elaine McMillion Sheldon. Our guests will address the portrayal of Appalachian culture in film and discuss their current … Continued\nThe post A Lens into Appalachia: A Conversation with Documentary Filmmakers appeared first on Speaking Volumes."
    },
    {
        "title": "Our short story contest winners are …",
        "link": "https://volumes.lib.utk.edu/news/our-short-story-contest-winners-are/",
        "date": "Thu, 01 Dec 2022 18:08:08 +0000",
        "contentSnippet": "Every November is National Novel Writing Month. Each year, the NaNoWriMo nonprofit organization hosts an international novel-writing challenge to promote creative writing. Once again, the UT Libraries and the Judith Anderson Herbert Writing Center joined in the fun by hosting our own short story contest. Fifty students dropped by our five-hour “write-in” on the evening … Continued\nThe post Our short story contest winners are … appeared first on Speaking Volumes."
    },
    {
        "title": "DeStress for Success",
        "link": "https://volumes.lib.utk.edu/news/destress-for-success/",
        "date": "Mon, 28 Nov 2022 21:10:26 +0000",
        "contentSnippet": "UT Libraries will offer a wide variety of activities and events for all Volunteers as part of its annual Destress for Success week, December 8–15. Be ready to walk the red carpet to success this year during finals!  At Hodges: Study Day, Thursday, December 8: In addition to study sessions with our Peer-Learning Assistants (formerly, tutors) from … Continued\nThe post DeStress for Success appeared first on Speaking Volumes."
    },
    {
        "title": "Event: Title IX — Impact on UT and Beyond",
        "link": "https://volumes.lib.utk.edu/news/event-title-ix/",
        "date": "Tue, 01 Nov 2022 16:06:45 +0000",
        "contentSnippet": "The University of Tennessee Press invites you to attend a panel discussion in celebration of Title IX’s 50th anniversary on November 10 at 5:30 p.m. EST in the Lindsay Young Auditorium at the John C. Hodges Library. Panelists will discuss Title IX’s impact on the university and beyond. Ashley Blamey, Title IX coordinator for the … Continued\nThe post Event: Title IX — Impact on UT and Beyond appeared first on Speaking Volumes."
    }
]